//! # IBM_DB
//!
//! `ibm_db` is a library for connecting to DB2.

// suppress for the whole module with inner attribute...
#![allow(non_snake_case, non_camel_case_types, non_upper_case_globals, dead_code, improper_ctypes)]

#[macro_use]
extern crate log;
pub extern crate odbc_safe;
extern crate encoding_rs;



pub use diagnostics::{DiagnosticRecord, GetDiagRec};
pub use result::Result;
pub use environment::*;
pub use connection::Connection;
pub use statement::*;
pub use ffi::*;

use odbc_object::OdbcObject;
use raii::Raii;
use result::{Return, into_result, try_into_option};
pub use odbc_safe as safe;

mod ffi;
mod odbc_object;
mod raii;
mod diagnostics;
mod result;
mod environment;
mod connection;
mod statement;


/// Reflects the ability of a type to expose a valid handle
pub trait Handle {
    type To;
    /// Returns a valid handle to the odbc type.
    unsafe fn handle(&self) -> *mut Self::To;
}

pub const DB2LINUX : u32 = 1 ;
pub const SQL_CMP_NA_ERRORS : u32 = 1 ;
pub const SQL_CMP_ROWS_AFFECTED : u32 = 2 ;
pub const SQL_CMP_STMTS_COMPLETED : u32 = 3 ;
pub const SQL_CMP_REF_INT_ROWS : u32 = 4 ;
pub const SQL_CONNECT_DB_APP2DB_CONVFACTOR : u32 = 0 ;
pub const SQL_CONNECT_DB_DB2APP_CONVFACTOR : u32 = 1 ;
pub const SQL_CONNECT_DB_UPDATEABILITY_IN_UOW : u32 = 2 ;
pub const SQL_CONNECT_DB_COMMIT_TYPE : u32 = 3 ;
pub const SQL_DB_UPDATEABLE : u32 = 1 ;
pub const SQL_DB_READ_ONLY : u32 = 2 ;
pub const SQL_DB_ONE_PHASE_COMMIT : u32 = 1 ;

pub const SQL_SEP_DASH : u32 = 2 ;
pub const SQL_SEP_PERIOD : u32 = 3 ;
pub const SQL_SEP_COMMA : u32 = 4 ;
pub const SQL_SEP_BLANK : u32 = 5 ;
pub const SQL_SEP_COLON : u32 = 6 ;
pub const SQL_SEP_JOB : u32 = 7 ;
pub const SQL_XML_DECLARATION_NONE : u32 = 0 ;
pub const SQL_XML_DECLARATION_BOM : u32 = 1 ;
pub const SQL_XML_DECLARATION_BASE : u32 = 2 ;
pub const SQL_XML_DECLARATION_ENCATTR : u32 = 4 ;
pub const SQL_DB2ZLOAD_RECDELIM_NONE : u32 = 0 ;
pub const SQL_DB2ZLOAD_RECDELIM_ALF : u32 = 1 ;
pub const SQL_DB2ZLOAD_RECDELIM_ENL : u32 = 2 ;
pub const SQL_DB2ZLOAD_RECDELIM_CRLF : u32 = 3 ;
pub const SQL_DB2ZLOAD_FILETYPE_DEL : u32 = 1 ;
pub const SQL_DB2ZLOAD_FILETYPE_INT : u32 = 2 ;
pub const SQL_DB2ZLOAD_FILETYPE_SPANNED : u32 = 3 ;
pub const DSD_ACR_AFFINITY : u32 = 1 ;
pub const SQL_ATTR_OUTPUT_NTS : u32 = 10001 ;
pub const SQL_FILE_READ : u32 = 2 ;
pub const SQL_FILE_CREATE : u32 = 8 ;
pub const SQL_FILE_OVERWRITE : u32 = 16 ;
pub const SQL_FILE_APPEND : u32 = 32 ;
pub const SQL_FROM_LOCATOR : u32 = 2 ;
pub const SQL_FROM_LITERAL : u32 = 3 ;
pub const SQL_ROUND_HALF_EVEN : u32 = 0 ;
pub const SQL_ROUND_HALF_UP : u32 = 1 ;
pub const SQL_ROUND_DOWN : u32 = 2 ;
pub const SQL_ROUND_CEILING : u32 = 3 ;
pub const SQL_ROUND_FLOOR : u32 = 4 ;
pub const SQL_NETWORK_STATISTICS_ON_SKIP_NOSERVER : u32 = 2 ;
pub const SQL_NETWORK_STATISTICS_ON : u32 = 1 ;
pub const SQL_NETWORK_STATISTICS_OFF : u32 = 0 ;
pub const SQL_NETWORK_STATISTICS_DEFAULT : u32 = 0 ;
pub const SQL_READ_ONLY_CONNECTION_ON : u32 = 1 ;
pub const SQL_READ_ONLY_CONNECTION_OFF : u32 = 0 ;
pub const SQL_READ_ONLY_CONNECTION_DEFAULT : u32 = 0 ;
pub const SQL_UNASSIGNED : i32 = - 7 ;
pub const SQL_DETECT_READ_ONLY_TXN_ENABLE : u32 = 1 ;
pub const SQL_DETECT_READ_ONLY_TXN_DISABLE : u32 = 0 ;
pub const SQL_C_WCHAR : i32 = - 8 ;
pub const SQL_C_TCHAR : u32 = 1 ;

# [doc = " Define fixed size integer types."] pub type sqlint8 = :: std :: os :: raw :: c_char ;
pub type sqluint8 = :: std :: os :: raw :: c_uchar ;
pub type sqlint16 = :: std :: os :: raw :: c_short ;
pub type sqluint16 = :: std :: os :: raw :: c_ushort ;
pub type sqlint32 = :: std :: os :: raw :: c_int ;
pub type sqluint32 = :: std :: os :: raw :: c_uint ;
pub type sqlint64 = :: std :: os :: raw :: c_long ;
pub type sqluint64 = :: std :: os :: raw :: c_ulong ;
pub type sqlintptr = sqlint64 ;
pub type sqluintptr = sqluint64 ;

# [repr (C)]
# [derive (Copy , Clone)] pub struct sqlca { pub sqlcaid : [:: std :: os :: raw :: c_char ;
    8usize] , pub sqlcabc : sqlint32 , pub sqlcode : sqlint32 , pub sqlerrml : :: std :: os :: raw :: c_short , pub sqlerrmc : [:: std :: os :: raw :: c_char ;
    70usize] , pub sqlerrp : [:: std :: os :: raw :: c_char ;
    8usize] , pub sqlerrd : [sqlint32 ;
    6usize] , pub sqlwarn : [:: std :: os :: raw :: c_char ;
    11usize] , pub sqlstate : [:: std :: os :: raw :: c_char ;
    5usize] , }
# [test] fn bindgen_test_layout_sqlca () { assert_eq ! (:: std :: mem :: size_of :: < sqlca > () , 136usize , concat ! ("Size of: " , stringify ! (sqlca))) ;
    assert_eq ! (:: std :: mem :: align_of :: < sqlca > () , 4usize , concat ! ("Alignment of " , stringify ! (sqlca))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlcaid as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlcaid))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlcabc as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlcabc))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlcode as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlcode))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlerrml as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlerrml))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlerrmc as * const _ as usize } , 18usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlerrmc))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlerrp as * const _ as usize } , 88usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlerrp))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlerrd as * const _ as usize } , 96usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlerrd))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlwarn as * const _ as usize } , 120usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlwarn))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < sqlca > ())) . sqlstate as * const _ as usize } , 131usize , concat ! ("Offset of field: " , stringify ! (sqlca) , "::" , stringify ! (sqlstate))) ;
} pub type size_t = :: std :: os :: raw :: c_ulong ;
pub type wchar_t = :: std :: os :: raw :: c_int ;
pub const idtype_t_P_ALL : idtype_t = 0 ;
pub const idtype_t_P_PID : idtype_t = 1 ;
pub const idtype_t_P_PGID : idtype_t = 2 ;
pub type idtype_t = :: std :: os :: raw :: c_uint ;
pub type _Float32 = f32 ;
pub type _Float64 = f64 ;
pub type _Float32x = f64 ;
pub type _Float64x = u128 ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct div_t { pub quot : :: std :: os :: raw :: c_int , pub rem : :: std :: os :: raw :: c_int , }
# [test] fn bindgen_test_layout_div_t () { assert_eq ! (:: std :: mem :: size_of :: < div_t > () , 8usize , concat ! ("Size of: " , stringify ! (div_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < div_t > () , 4usize , concat ! ("Alignment of " , stringify ! (div_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < div_t > ())) . quot as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (div_t) , "::" , stringify ! (quot))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < div_t > ())) . rem as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (div_t) , "::" , stringify ! (rem))) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct ldiv_t { pub quot : :: std :: os :: raw :: c_long , pub rem : :: std :: os :: raw :: c_long , }
# [test] fn bindgen_test_layout_ldiv_t () { assert_eq ! (:: std :: mem :: size_of :: < ldiv_t > () , 16usize , concat ! ("Size of: " , stringify ! (ldiv_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < ldiv_t > () , 8usize , concat ! ("Alignment of " , stringify ! (ldiv_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < ldiv_t > ())) . quot as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (ldiv_t) , "::" , stringify ! (quot))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < ldiv_t > ())) . rem as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (ldiv_t) , "::" , stringify ! (rem))) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct lldiv_t { pub quot : :: std :: os :: raw :: c_longlong , pub rem : :: std :: os :: raw :: c_longlong , }
# [test] fn bindgen_test_layout_lldiv_t () { assert_eq ! (:: std :: mem :: size_of :: < lldiv_t > () , 16usize , concat ! ("Size of: " , stringify ! (lldiv_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < lldiv_t > () , 8usize , concat ! ("Alignment of " , stringify ! (lldiv_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < lldiv_t > ())) . quot as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (lldiv_t) , "::" , stringify ! (quot))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < lldiv_t > ())) . rem as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (lldiv_t) , "::" , stringify ! (rem))) ;
} extern "C" { pub fn __ctype_get_mb_cur_max () -> size_t ;
} extern "C" { pub fn atof (__nptr : * const :: std :: os :: raw :: c_char) -> f64 ;
} extern "C" { pub fn atoi (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn atol (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn atoll (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_longlong ;
} extern "C" { pub fn strtod (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> f64 ;
} extern "C" { pub fn strtof (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> f32 ;
} extern "C" { pub fn strtold (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> u128 ;
} extern "C" { pub fn strtol (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn strtoul (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulong ;
} extern "C" { pub fn strtoq (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_longlong ;
} extern "C" { pub fn strtouq (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulonglong ;
} extern "C" { pub fn strtoll (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_longlong ;
} extern "C" { pub fn strtoull (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulonglong ;
} extern "C" { pub fn l64a (__n : :: std :: os :: raw :: c_long) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn a64l (__s : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_long ;
} pub type __u_char = :: std :: os :: raw :: c_uchar ;
pub type __u_short = :: std :: os :: raw :: c_ushort ;
pub type __u_int = :: std :: os :: raw :: c_uint ;
pub type __u_long = :: std :: os :: raw :: c_ulong ;
pub type __int8_t = :: std :: os :: raw :: c_schar ;
pub type __uint8_t = :: std :: os :: raw :: c_uchar ;
pub type __int16_t = :: std :: os :: raw :: c_short ;
pub type __uint16_t = :: std :: os :: raw :: c_ushort ;
pub type __int32_t = :: std :: os :: raw :: c_int ;
pub type __uint32_t = :: std :: os :: raw :: c_uint ;
pub type __int64_t = :: std :: os :: raw :: c_long ;
pub type __uint64_t = :: std :: os :: raw :: c_ulong ;
pub type __quad_t = :: std :: os :: raw :: c_long ;
pub type __u_quad_t = :: std :: os :: raw :: c_ulong ;
pub type __intmax_t = :: std :: os :: raw :: c_long ;
pub type __uintmax_t = :: std :: os :: raw :: c_ulong ;
pub type __dev_t = :: std :: os :: raw :: c_ulong ;
pub type __uid_t = :: std :: os :: raw :: c_uint ;
pub type __gid_t = :: std :: os :: raw :: c_uint ;
pub type __ino_t = :: std :: os :: raw :: c_ulong ;
pub type __ino64_t = :: std :: os :: raw :: c_ulong ;
pub type __mode_t = :: std :: os :: raw :: c_uint ;
pub type __nlink_t = :: std :: os :: raw :: c_ulong ;
pub type __off_t = :: std :: os :: raw :: c_long ;
pub type __off64_t = :: std :: os :: raw :: c_long ;
pub type __pid_t = :: std :: os :: raw :: c_int ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __fsid_t { pub __val : [:: std :: os :: raw :: c_int ;
    2usize] , }
# [test] fn bindgen_test_layout___fsid_t () { assert_eq ! (:: std :: mem :: size_of :: < __fsid_t > () , 8usize , concat ! ("Size of: " , stringify ! (__fsid_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __fsid_t > () , 4usize , concat ! ("Alignment of " , stringify ! (__fsid_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __fsid_t > ())) . __val as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__fsid_t) , "::" , stringify ! (__val))) ;
} pub type __clock_t = :: std :: os :: raw :: c_long ;
pub type __rlim_t = :: std :: os :: raw :: c_ulong ;
pub type __rlim64_t = :: std :: os :: raw :: c_ulong ;
pub type __id_t = :: std :: os :: raw :: c_uint ;
pub type __time_t = :: std :: os :: raw :: c_long ;
pub type __useconds_t = :: std :: os :: raw :: c_uint ;
pub type __suseconds_t = :: std :: os :: raw :: c_long ;
pub type __daddr_t = :: std :: os :: raw :: c_int ;
pub type __key_t = :: std :: os :: raw :: c_int ;
pub type __clockid_t = :: std :: os :: raw :: c_int ;
pub type __timer_t = * mut :: std :: os :: raw :: c_void ;
pub type __blksize_t = :: std :: os :: raw :: c_long ;
pub type __blkcnt_t = :: std :: os :: raw :: c_long ;
pub type __blkcnt64_t = :: std :: os :: raw :: c_long ;
pub type __fsblkcnt_t = :: std :: os :: raw :: c_ulong ;
pub type __fsblkcnt64_t = :: std :: os :: raw :: c_ulong ;
pub type __fsfilcnt_t = :: std :: os :: raw :: c_ulong ;
pub type __fsfilcnt64_t = :: std :: os :: raw :: c_ulong ;
pub type __fsword_t = :: std :: os :: raw :: c_long ;
pub type __ssize_t = :: std :: os :: raw :: c_long ;
pub type __syscall_slong_t = :: std :: os :: raw :: c_long ;
pub type __syscall_ulong_t = :: std :: os :: raw :: c_ulong ;
pub type __loff_t = __off64_t ;
pub type __caddr_t = * mut :: std :: os :: raw :: c_char ;
pub type __intptr_t = :: std :: os :: raw :: c_long ;
pub type __socklen_t = :: std :: os :: raw :: c_uint ;
pub type __sig_atomic_t = :: std :: os :: raw :: c_int ;
pub type u_char = __u_char ;
pub type u_short = __u_short ;
pub type u_int = __u_int ;
pub type u_long = __u_long ;
pub type quad_t = __quad_t ;
pub type u_quad_t = __u_quad_t ;
pub type fsid_t = __fsid_t ;
pub type loff_t = __loff_t ;
pub type ino_t = __ino_t ;
pub type dev_t = __dev_t ;
pub type gid_t = __gid_t ;
pub type mode_t = __mode_t ;
pub type nlink_t = __nlink_t ;
pub type uid_t = __uid_t ;
pub type off_t = __off_t ;
pub type pid_t = __pid_t ;
pub type id_t = __id_t ;
pub type ssize_t = __ssize_t ;
pub type daddr_t = __daddr_t ;
pub type caddr_t = __caddr_t ;
pub type key_t = __key_t ;
pub type clock_t = __clock_t ;
pub type clockid_t = __clockid_t ;
pub type time_t = __time_t ;
pub type timer_t = __timer_t ;
pub type ulong = :: std :: os :: raw :: c_ulong ;
pub type ushort = :: std :: os :: raw :: c_ushort ;
pub type uint = :: std :: os :: raw :: c_uint ;
pub type u_int8_t = :: std :: os :: raw :: c_uchar ;
pub type u_int16_t = :: std :: os :: raw :: c_ushort ;
pub type u_int32_t = :: std :: os :: raw :: c_uint ;
pub type u_int64_t = :: std :: os :: raw :: c_ulong ;
pub type register_t = :: std :: os :: raw :: c_long ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __sigset_t { pub __val : [:: std :: os :: raw :: c_ulong ;
    16usize] , }
# [test] fn bindgen_test_layout___sigset_t () { assert_eq ! (:: std :: mem :: size_of :: < __sigset_t > () , 128usize , concat ! ("Size of: " , stringify ! (__sigset_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __sigset_t > () , 8usize , concat ! ("Alignment of " , stringify ! (__sigset_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __sigset_t > ())) . __val as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__sigset_t) , "::" , stringify ! (__val))) ;
} pub type sigset_t = __sigset_t ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct timeval { pub tv_sec : __time_t , pub tv_usec : __suseconds_t , }
# [test] fn bindgen_test_layout_timeval () { assert_eq ! (:: std :: mem :: size_of :: < timeval > () , 16usize , concat ! ("Size of: " , stringify ! (timeval))) ;
    assert_eq ! (:: std :: mem :: align_of :: < timeval > () , 8usize , concat ! ("Alignment of " , stringify ! (timeval))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < timeval > ())) . tv_sec as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (timeval) , "::" , stringify ! (tv_sec))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < timeval > ())) . tv_usec as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (timeval) , "::" , stringify ! (tv_usec))) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct timespec { pub tv_sec : __time_t , pub tv_nsec : __syscall_slong_t , }
# [test] fn bindgen_test_layout_timespec () { assert_eq ! (:: std :: mem :: size_of :: < timespec > () , 16usize , concat ! ("Size of: " , stringify ! (timespec))) ;
    assert_eq ! (:: std :: mem :: align_of :: < timespec > () , 8usize , concat ! ("Alignment of " , stringify ! (timespec))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < timespec > ())) . tv_sec as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (timespec) , "::" , stringify ! (tv_sec))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < timespec > ())) . tv_nsec as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (timespec) , "::" , stringify ! (tv_nsec))) ;
} pub type suseconds_t = __suseconds_t ;
pub type __fd_mask = :: std :: os :: raw :: c_long ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct fd_set { pub __fds_bits : [__fd_mask ;
    16usize] , }
# [test] fn bindgen_test_layout_fd_set () { assert_eq ! (:: std :: mem :: size_of :: < fd_set > () , 128usize , concat ! ("Size of: " , stringify ! (fd_set))) ;
    assert_eq ! (:: std :: mem :: align_of :: < fd_set > () , 8usize , concat ! ("Alignment of " , stringify ! (fd_set))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < fd_set > ())) . __fds_bits as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (fd_set) , "::" , stringify ! (__fds_bits))) ;
} pub type fd_mask = __fd_mask ;
extern "C" { pub fn select (__nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * mut timeval) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn pselect (__nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * const timespec , __sigmask : * const __sigset_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn gnu_dev_major (__dev : __dev_t) -> :: std :: os :: raw :: c_uint ;
} extern "C" { pub fn gnu_dev_minor (__dev : __dev_t) -> :: std :: os :: raw :: c_uint ;
} extern "C" { pub fn gnu_dev_makedev (__major : :: std :: os :: raw :: c_uint , __minor : :: std :: os :: raw :: c_uint) -> __dev_t ;
} pub type blksize_t = __blksize_t ;
pub type blkcnt_t = __blkcnt_t ;
pub type fsblkcnt_t = __fsblkcnt_t ;
pub type fsfilcnt_t = __fsfilcnt_t ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __pthread_rwlock_arch_t { pub __readers : :: std :: os :: raw :: c_uint , pub __writers : :: std :: os :: raw :: c_uint , pub __wrphase_futex : :: std :: os :: raw :: c_uint , pub __writers_futex : :: std :: os :: raw :: c_uint , pub __pad3 : :: std :: os :: raw :: c_uint , pub __pad4 : :: std :: os :: raw :: c_uint , pub __cur_writer : :: std :: os :: raw :: c_int , pub __shared : :: std :: os :: raw :: c_int , pub __rwelision : :: std :: os :: raw :: c_schar , pub __pad1 : [:: std :: os :: raw :: c_uchar ;
    7usize] , pub __pad2 : :: std :: os :: raw :: c_ulong , pub __flags : :: std :: os :: raw :: c_uint , }
# [test] fn bindgen_test_layout___pthread_rwlock_arch_t () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_rwlock_arch_t > () , 56usize , concat ! ("Size of: " , stringify ! (__pthread_rwlock_arch_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_rwlock_arch_t > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_rwlock_arch_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __readers as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__readers))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __writers as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__writers))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __wrphase_futex as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__wrphase_futex))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __writers_futex as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__writers_futex))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __pad3 as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__pad3))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __pad4 as * const _ as usize } , 20usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__pad4))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __cur_writer as * const _ as usize } , 24usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__cur_writer))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __shared as * const _ as usize } , 28usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__shared))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __rwelision as * const _ as usize } , 32usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__rwelision))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __pad1 as * const _ as usize } , 33usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__pad1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __pad2 as * const _ as usize } , 40usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__pad2))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_rwlock_arch_t > ())) . __flags as * const _ as usize } , 48usize , concat ! ("Offset of field: " , stringify ! (__pthread_rwlock_arch_t) , "::" , stringify ! (__flags))) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __pthread_internal_list { pub __prev : * mut __pthread_internal_list , pub __next : * mut __pthread_internal_list , }
# [test] fn bindgen_test_layout___pthread_internal_list () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_internal_list > () , 16usize , concat ! ("Size of: " , stringify ! (__pthread_internal_list))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_internal_list > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_internal_list))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_internal_list > ())) . __prev as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_internal_list) , "::" , stringify ! (__prev))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_internal_list > ())) . __next as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (__pthread_internal_list) , "::" , stringify ! (__next))) ;
} pub type __pthread_list_t = __pthread_internal_list ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __pthread_mutex_s { pub __lock : :: std :: os :: raw :: c_int , pub __count : :: std :: os :: raw :: c_uint , pub __owner : :: std :: os :: raw :: c_int , pub __nusers : :: std :: os :: raw :: c_uint , pub __kind : :: std :: os :: raw :: c_int , pub __spins : :: std :: os :: raw :: c_short , pub __elision : :: std :: os :: raw :: c_short , pub __list : __pthread_list_t , }
# [test] fn bindgen_test_layout___pthread_mutex_s () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_mutex_s > () , 40usize , concat ! ("Size of: " , stringify ! (__pthread_mutex_s))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_mutex_s > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_mutex_s))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __lock as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__lock))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __count as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__count))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __owner as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__owner))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __nusers as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__nusers))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __kind as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__kind))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __spins as * const _ as usize } , 20usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__spins))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __elision as * const _ as usize } , 22usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__elision))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_mutex_s > ())) . __list as * const _ as usize } , 24usize , concat ! ("Offset of field: " , stringify ! (__pthread_mutex_s) , "::" , stringify ! (__list))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub struct __pthread_cond_s { pub __bindgen_anon_1 : __pthread_cond_s__bindgen_ty_1 , pub __bindgen_anon_2 : __pthread_cond_s__bindgen_ty_2 , pub __g_refs : [:: std :: os :: raw :: c_uint ;
    2usize] , pub __g_size : [:: std :: os :: raw :: c_uint ;
    2usize] , pub __g1_orig_size : :: std :: os :: raw :: c_uint , pub __wrefs : :: std :: os :: raw :: c_uint , pub __g_signals : [:: std :: os :: raw :: c_uint ;
    2usize] , }
# [repr (C)]
# [derive (Copy , Clone)] pub union __pthread_cond_s__bindgen_ty_1 { pub __wseq : :: std :: os :: raw :: c_ulonglong , pub __wseq32 : __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 , _bindgen_union_align : u64 , }
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 { pub __low : :: std :: os :: raw :: c_uint , pub __high : :: std :: os :: raw :: c_uint , }
# [test] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > () , 8usize , concat ! ("Size of: " , stringify ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > () , 4usize , concat ! ("Alignment of " , stringify ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > ())) . __low as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1) , "::" , stringify ! (__low))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > ())) . __high as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1) , "::" , stringify ! (__high))) ;
}
# [test] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1 > () , 8usize , concat ! ("Size of: " , stringify ! (__pthread_cond_s__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1 > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_cond_s__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_1 > ())) . __wseq as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_1) , "::" , stringify ! (__wseq))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_1 > ())) . __wseq32 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_1) , "::" , stringify ! (__wseq32))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union __pthread_cond_s__bindgen_ty_2 { pub __g1_start : :: std :: os :: raw :: c_ulonglong , pub __g1_start32 : __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 , _bindgen_union_align : u64 , }
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 { pub __low : :: std :: os :: raw :: c_uint , pub __high : :: std :: os :: raw :: c_uint , }
# [test] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > () , 8usize , concat ! ("Size of: " , stringify ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > () , 4usize , concat ! ("Alignment of " , stringify ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > ())) . __low as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1) , "::" , stringify ! (__low))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > ())) . __high as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1) , "::" , stringify ! (__high))) ;
}
# [test] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2 () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2 > () , 8usize , concat ! ("Size of: " , stringify ! (__pthread_cond_s__bindgen_ty_2))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2 > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_cond_s__bindgen_ty_2))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_2 > ())) . __g1_start as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_2) , "::" , stringify ! (__g1_start))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s__bindgen_ty_2 > ())) . __g1_start32 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s__bindgen_ty_2) , "::" , stringify ! (__g1_start32))) ;
}
# [test] fn bindgen_test_layout___pthread_cond_s () { assert_eq ! (:: std :: mem :: size_of :: < __pthread_cond_s > () , 48usize , concat ! ("Size of: " , stringify ! (__pthread_cond_s))) ;
    assert_eq ! (:: std :: mem :: align_of :: < __pthread_cond_s > () , 8usize , concat ! ("Alignment of " , stringify ! (__pthread_cond_s))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s > ())) . __g_refs as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s) , "::" , stringify ! (__g_refs))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s > ())) . __g_size as * const _ as usize } , 24usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s) , "::" , stringify ! (__g_size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s > ())) . __g1_orig_size as * const _ as usize } , 32usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s) , "::" , stringify ! (__g1_orig_size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s > ())) . __wrefs as * const _ as usize } , 36usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s) , "::" , stringify ! (__wrefs))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < __pthread_cond_s > ())) . __g_signals as * const _ as usize } , 40usize , concat ! ("Offset of field: " , stringify ! (__pthread_cond_s) , "::" , stringify ! (__g_signals))) ;
} pub type pthread_t = :: std :: os :: raw :: c_ulong ;

# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_mutexattr_t { pub __size : [:: std :: os :: raw :: c_char ;
    4usize] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , }
# [test] fn bindgen_test_layout_pthread_mutexattr_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_mutexattr_t > () , 4usize , concat ! ("Size of: " , stringify ! (pthread_mutexattr_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_mutexattr_t > () , 4usize , concat ! ("Alignment of " , stringify ! (pthread_mutexattr_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_mutexattr_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_mutexattr_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_mutexattr_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_mutexattr_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_condattr_t { pub __size : [:: std :: os :: raw :: c_char ;
    4usize] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , }
# [test] fn bindgen_test_layout_pthread_condattr_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_condattr_t > () , 4usize , concat ! ("Size of: " , stringify ! (pthread_condattr_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_condattr_t > () , 4usize , concat ! ("Alignment of " , stringify ! (pthread_condattr_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_condattr_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_condattr_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_condattr_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_condattr_t) , "::" , stringify ! (__align))) ;
} pub type pthread_key_t = :: std :: os :: raw :: c_uint ;
pub type pthread_once_t = :: std :: os :: raw :: c_int ;

# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_attr_t { pub __size : [:: std :: os :: raw :: c_char ;
    56usize] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [u64 ;
    7usize] , }
# [test] fn bindgen_test_layout_pthread_attr_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_attr_t > () , 56usize , concat ! ("Size of: " , stringify ! (pthread_attr_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_attr_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_attr_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_attr_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_attr_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_attr_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_attr_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_mutex_t { pub __data : __pthread_mutex_s , pub __size : [:: std :: os :: raw :: c_char ;
    40usize] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [u64 ;
    5usize] , }
# [test] fn bindgen_test_layout_pthread_mutex_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_mutex_t > () , 40usize , concat ! ("Size of: " , stringify ! (pthread_mutex_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_mutex_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_mutex_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_mutex_t > ())) . __data as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_mutex_t) , "::" , stringify ! (__data))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_mutex_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_mutex_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_mutex_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_mutex_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_cond_t { pub __data : __pthread_cond_s , pub __size : [:: std :: os :: raw :: c_char ;
    48usize] , pub __align : :: std :: os :: raw :: c_longlong , _bindgen_union_align : [u64 ;
    6usize] , }
# [test] fn bindgen_test_layout_pthread_cond_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_cond_t > () , 48usize , concat ! ("Size of: " , stringify ! (pthread_cond_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_cond_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_cond_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_cond_t > ())) . __data as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_cond_t) , "::" , stringify ! (__data))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_cond_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_cond_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_cond_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_cond_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_rwlock_t { pub __data : __pthread_rwlock_arch_t , pub __size : [:: std :: os :: raw :: c_char ;
    56usize] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [u64 ;
    7usize] , }
# [test] fn bindgen_test_layout_pthread_rwlock_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_rwlock_t > () , 56usize , concat ! ("Size of: " , stringify ! (pthread_rwlock_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_rwlock_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_rwlock_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_rwlock_t > ())) . __data as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_rwlock_t) , "::" , stringify ! (__data))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_rwlock_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_rwlock_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_rwlock_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_rwlock_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_rwlockattr_t { pub __size : [:: std :: os :: raw :: c_char ;
    8usize] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : u64 , }
# [test] fn bindgen_test_layout_pthread_rwlockattr_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_rwlockattr_t > () , 8usize , concat ! ("Size of: " , stringify ! (pthread_rwlockattr_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_rwlockattr_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_rwlockattr_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_rwlockattr_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_rwlockattr_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_rwlockattr_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_rwlockattr_t) , "::" , stringify ! (__align))) ;
} pub type pthread_spinlock_t = :: std :: os :: raw :: c_int ;

# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_barrier_t { pub __size : [:: std :: os :: raw :: c_char ;
    32usize] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [u64 ;
    4usize] , }
# [test] fn bindgen_test_layout_pthread_barrier_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_barrier_t > () , 32usize , concat ! ("Size of: " , stringify ! (pthread_barrier_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_barrier_t > () , 8usize , concat ! ("Alignment of " , stringify ! (pthread_barrier_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_barrier_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_barrier_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_barrier_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_barrier_t) , "::" , stringify ! (__align))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union pthread_barrierattr_t { pub __size : [:: std :: os :: raw :: c_char ;
    4usize] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , }
# [test] fn bindgen_test_layout_pthread_barrierattr_t () { assert_eq ! (:: std :: mem :: size_of :: < pthread_barrierattr_t > () , 4usize , concat ! ("Size of: " , stringify ! (pthread_barrierattr_t))) ;
    assert_eq ! (:: std :: mem :: align_of :: < pthread_barrierattr_t > () , 4usize , concat ! ("Alignment of " , stringify ! (pthread_barrierattr_t))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_barrierattr_t > ())) . __size as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_barrierattr_t) , "::" , stringify ! (__size))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < pthread_barrierattr_t > ())) . __align as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (pthread_barrierattr_t) , "::" , stringify ! (__align))) ;
} extern "C" { pub fn random () -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn srandom (__seed : :: std :: os :: raw :: c_uint) ;
} extern "C" { pub fn initstate (__seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : size_t) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn setstate (__statebuf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct random_data { pub fptr : * mut i32 , pub rptr : * mut i32 , pub state : * mut i32 , pub rand_type : :: std :: os :: raw :: c_int , pub rand_deg : :: std :: os :: raw :: c_int , pub rand_sep : :: std :: os :: raw :: c_int , pub end_ptr : * mut i32 , }
# [test] fn bindgen_test_layout_random_data () { assert_eq ! (:: std :: mem :: size_of :: < random_data > () , 48usize , concat ! ("Size of: " , stringify ! (random_data))) ;
    assert_eq ! (:: std :: mem :: align_of :: < random_data > () , 8usize , concat ! ("Alignment of " , stringify ! (random_data))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . fptr as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (fptr))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . rptr as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (rptr))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . state as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (state))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . rand_type as * const _ as usize } , 24usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (rand_type))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . rand_deg as * const _ as usize } , 28usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (rand_deg))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . rand_sep as * const _ as usize } , 32usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (rand_sep))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < random_data > ())) . end_ptr as * const _ as usize } , 40usize , concat ! ("Offset of field: " , stringify ! (random_data) , "::" , stringify ! (end_ptr))) ;
} extern "C" { pub fn random_r (__buf : * mut random_data , __result : * mut i32) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn srandom_r (__seed : :: std :: os :: raw :: c_uint , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn initstate_r (__seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : size_t , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn setstate_r (__statebuf : * mut :: std :: os :: raw :: c_char , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn rand () -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn srand (__seed : :: std :: os :: raw :: c_uint) ;
} extern "C" { pub fn rand_r (__seed : * mut :: std :: os :: raw :: c_uint) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn drand48 () -> f64 ;
} extern "C" { pub fn erand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> f64 ;
} extern "C" { pub fn lrand48 () -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn nrand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn mrand48 () -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn jrand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn srand48 (__seedval : :: std :: os :: raw :: c_long) ;
} extern "C" { pub fn seed48 (__seed16v : * mut :: std :: os :: raw :: c_ushort) -> * mut :: std :: os :: raw :: c_ushort ;
} extern "C" { pub fn lcong48 (__param : * mut :: std :: os :: raw :: c_ushort) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct drand48_data { pub __x : [:: std :: os :: raw :: c_ushort ;
    3usize] , pub __old_x : [:: std :: os :: raw :: c_ushort ;
    3usize] , pub __c : :: std :: os :: raw :: c_ushort , pub __init : :: std :: os :: raw :: c_ushort , pub __a : :: std :: os :: raw :: c_ulonglong , }
# [test] fn bindgen_test_layout_drand48_data () { assert_eq ! (:: std :: mem :: size_of :: < drand48_data > () , 24usize , concat ! ("Size of: " , stringify ! (drand48_data))) ;
    assert_eq ! (:: std :: mem :: align_of :: < drand48_data > () , 8usize , concat ! ("Alignment of " , stringify ! (drand48_data))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < drand48_data > ())) . __x as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (drand48_data) , "::" , stringify ! (__x))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < drand48_data > ())) . __old_x as * const _ as usize } , 6usize , concat ! ("Offset of field: " , stringify ! (drand48_data) , "::" , stringify ! (__old_x))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < drand48_data > ())) . __c as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (drand48_data) , "::" , stringify ! (__c))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < drand48_data > ())) . __init as * const _ as usize } , 14usize , concat ! ("Offset of field: " , stringify ! (drand48_data) , "::" , stringify ! (__init))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < drand48_data > ())) . __a as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (drand48_data) , "::" , stringify ! (__a))) ;
} extern "C" { pub fn drand48_r (__buffer : * mut drand48_data , __result : * mut f64) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn erand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut f64) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn lrand48_r (__buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn nrand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mrand48_r (__buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn jrand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn srand48_r (__seedval : :: std :: os :: raw :: c_long , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn seed48_r (__seed16v : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn lcong48_r (__param : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn malloc (__size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn calloc (__nmemb : :: std :: os :: raw :: c_ulong , __size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn realloc (__ptr : * mut :: std :: os :: raw :: c_void , __size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn free (__ptr : * mut :: std :: os :: raw :: c_void) ;
} extern "C" { pub fn alloca (__size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn valloc (__size : size_t) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn posix_memalign (__memptr : * mut * mut :: std :: os :: raw :: c_void , __alignment : size_t , __size : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn aligned_alloc (__alignment : size_t , __size : size_t) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn abort () ;
} extern "C" { pub fn atexit (__func : :: std :: option :: Option < unsafe extern "C" fn () >) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn at_quick_exit (__func : :: std :: option :: Option < unsafe extern "C" fn () >) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn on_exit (__func : :: std :: option :: Option < unsafe extern "C" fn (__status : :: std :: os :: raw :: c_int , __arg : * mut :: std :: os :: raw :: c_void) > , __arg : * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn exit (__status : :: std :: os :: raw :: c_int) ;
} extern "C" { pub fn quick_exit (__status : :: std :: os :: raw :: c_int) ;
} extern "C" { pub fn _Exit (__status : :: std :: os :: raw :: c_int) ;
} extern "C" { pub fn getenv (__name : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn putenv (__string : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn setenv (__name : * const :: std :: os :: raw :: c_char , __value : * const :: std :: os :: raw :: c_char , __replace : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn unsetenv (__name : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn clearenv () -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mktemp (__template : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn mkstemp (__template : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mkstemps (__template : * mut :: std :: os :: raw :: c_char , __suffixlen : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mkdtemp (__template : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn system (__command : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn realpath (__name : * const :: std :: os :: raw :: c_char , __resolved : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} pub type __compar_fn_t = :: std :: option :: Option < unsafe extern "C" fn (arg1 : * const :: std :: os :: raw :: c_void , arg2 : * const :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int > ;
extern "C" { pub fn bsearch (__key : * const :: std :: os :: raw :: c_void , __base : * const :: std :: os :: raw :: c_void , __nmemb : size_t , __size : size_t , __compar : __compar_fn_t) -> * mut :: std :: os :: raw :: c_void ;
} extern "C" { pub fn qsort (__base : * mut :: std :: os :: raw :: c_void , __nmemb : size_t , __size : size_t , __compar : __compar_fn_t) ;
} extern "C" { pub fn abs (__x : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn labs (__x : :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_long ;
} extern "C" { pub fn llabs (__x : :: std :: os :: raw :: c_longlong) -> :: std :: os :: raw :: c_longlong ;
} extern "C" { pub fn div (__numer : :: std :: os :: raw :: c_int , __denom : :: std :: os :: raw :: c_int) -> div_t ;
} extern "C" { pub fn ldiv (__numer : :: std :: os :: raw :: c_long , __denom : :: std :: os :: raw :: c_long) -> ldiv_t ;
} extern "C" { pub fn lldiv (__numer : :: std :: os :: raw :: c_longlong , __denom : :: std :: os :: raw :: c_longlong) -> lldiv_t ;
} extern "C" { pub fn ecvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn fcvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn gcvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn qecvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn qfcvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn qgcvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ;
} extern "C" { pub fn ecvt_r (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn fcvt_r (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn qecvt_r (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn qfcvt_r (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mblen (__s : * const :: std :: os :: raw :: c_char , __n : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mbtowc (__pwc : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : size_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn wctomb (__s : * mut :: std :: os :: raw :: c_char , __wchar : wchar_t) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn mbstowcs (__pwcs : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : size_t) -> size_t ;
} extern "C" { pub fn wcstombs (__s : * mut :: std :: os :: raw :: c_char , __pwcs : * const wchar_t , __n : size_t) -> size_t ;
} extern "C" { pub fn rpmatch (__response : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn getsubopt (__optionp : * mut * mut :: std :: os :: raw :: c_char , __tokens : * const * mut :: std :: os :: raw :: c_char , __valuep : * mut * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ;
} extern "C" { pub fn getloadavg (__loadavg : * mut f64 , __nelem : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ;
} pub type SCHAR = :: std :: os :: raw :: c_schar ;
pub type UCHAR = :: std :: os :: raw :: c_uchar ;
pub type SWORD = :: std :: os :: raw :: c_short ;
pub type USHORT = :: std :: os :: raw :: c_ushort ;
pub type SSHORT = :: std :: os :: raw :: c_short ;
pub type UWORD = :: std :: os :: raw :: c_ushort ;
pub type SDWORD = sqlint32 ;
pub type ULONG = sqluint32 ;
pub type UDWORD = sqluint32 ;
pub type SLONG = sqlint32 ;
pub type SDOUBLE = f64 ;
pub type SFLOAT = f32 ;
pub type SQLDATE = :: std :: os :: raw :: c_uchar ;
pub type SQLTIME = :: std :: os :: raw :: c_uchar ;
pub type SQLTIMESTAMP = :: std :: os :: raw :: c_uchar ;
pub type SQLDECIMAL = :: std :: os :: raw :: c_uchar ;
pub type SQLNUMERIC = :: std :: os :: raw :: c_uchar ;
pub type LDOUBLE = f64 ;
pub type PTR = * mut :: std :: os :: raw :: c_void ;
pub type HENV = * mut :: std :: os :: raw :: c_void ;
pub type HDBC = * mut :: std :: os :: raw :: c_void ;
pub type HSTMT = * mut :: std :: os :: raw :: c_void ;
pub type RETCODE = :: std :: os :: raw :: c_short ;
pub type SQLCHAR = UCHAR ;
pub type SQLVARCHAR = UCHAR ;
pub type SQLSCHAR = SCHAR ;
pub type SQLINTEGER = SDWORD ;
pub type SQLSMALLINT = SWORD ;
pub type SQLDOUBLE = SDOUBLE ;
pub type SQLFLOAT = SDOUBLE ;
pub type SQLREAL = SFLOAT ;
pub type SQLRETURN = SQLSMALLINT ;
pub type SQLUINTEGER = UDWORD ;
pub type SQLUSMALLINT = UWORD ;
pub type SQLPOINTER = PTR ;
pub type SQLDBCHAR = :: std :: os :: raw :: c_ushort ;
pub type SQLWCHAR = :: std :: os :: raw :: c_ushort ;
pub type SQLTCHAR = SQLCHAR ;
pub type SQLHANDLE = SQLINTEGER ;
pub type SQLHENV = SQLINTEGER ;
pub type SQLHDBC = SQLINTEGER ;
pub type SQLHSTMT = SQLINTEGER ;
pub type SQLHWND = SQLPOINTER ;
pub type SQLHDESC = SQLHANDLE ;
pub type SQLBIGINT = :: std :: os :: raw :: c_long ;
pub type SQLUBIGINT = :: std :: os :: raw :: c_ulong ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct DATE_STRUCT { pub year : SQLSMALLINT , pub month : SQLUSMALLINT , pub day : SQLUSMALLINT , }
# [test] fn bindgen_test_layout_DATE_STRUCT () { assert_eq ! (:: std :: mem :: size_of :: < DATE_STRUCT > () , 6usize , concat ! ("Size of: " , stringify ! (DATE_STRUCT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < DATE_STRUCT > () , 2usize , concat ! ("Alignment of " , stringify ! (DATE_STRUCT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < DATE_STRUCT > ())) . year as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (DATE_STRUCT) , "::" , stringify ! (year))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < DATE_STRUCT > ())) . month as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (DATE_STRUCT) , "::" , stringify ! (month))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < DATE_STRUCT > ())) . day as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (DATE_STRUCT) , "::" , stringify ! (day))) ;
} pub type SQL_DATE_STRUCT = DATE_STRUCT ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct TIME_STRUCT { pub hour : SQLUSMALLINT , pub minute : SQLUSMALLINT , pub second : SQLUSMALLINT , }
# [test] fn bindgen_test_layout_TIME_STRUCT () { assert_eq ! (:: std :: mem :: size_of :: < TIME_STRUCT > () , 6usize , concat ! ("Size of: " , stringify ! (TIME_STRUCT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < TIME_STRUCT > () , 2usize , concat ! ("Alignment of " , stringify ! (TIME_STRUCT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIME_STRUCT > ())) . hour as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (TIME_STRUCT) , "::" , stringify ! (hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIME_STRUCT > ())) . minute as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (TIME_STRUCT) , "::" , stringify ! (minute))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIME_STRUCT > ())) . second as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (TIME_STRUCT) , "::" , stringify ! (second))) ;
} pub type SQL_TIME_STRUCT = TIME_STRUCT ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct TIMESTAMP_STRUCT { pub year : SQLSMALLINT , pub month : SQLUSMALLINT , pub day : SQLUSMALLINT , pub hour : SQLUSMALLINT , pub minute : SQLUSMALLINT , pub second : SQLUSMALLINT , pub fraction : SQLUINTEGER , }
# [test] fn bindgen_test_layout_TIMESTAMP_STRUCT () { assert_eq ! (:: std :: mem :: size_of :: < TIMESTAMP_STRUCT > () , 16usize , concat ! ("Size of: " , stringify ! (TIMESTAMP_STRUCT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < TIMESTAMP_STRUCT > () , 4usize , concat ! ("Alignment of " , stringify ! (TIMESTAMP_STRUCT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . year as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (year))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . month as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (month))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . day as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (day))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . hour as * const _ as usize } , 6usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . minute as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (minute))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . second as * const _ as usize } , 10usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (second))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT > ())) . fraction as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT) , "::" , stringify ! (fraction))) ;
} pub type SQL_TIMESTAMP_STRUCT = TIMESTAMP_STRUCT ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct TIMESTAMP_STRUCT_EXT { pub year : SQLSMALLINT , pub month : SQLUSMALLINT , pub day : SQLUSMALLINT , pub hour : SQLUSMALLINT , pub minute : SQLUSMALLINT , pub second : SQLUSMALLINT , pub fraction : SQLUINTEGER , pub fraction2 : SQLUINTEGER , }
# [test] fn bindgen_test_layout_TIMESTAMP_STRUCT_EXT () { assert_eq ! (:: std :: mem :: size_of :: < TIMESTAMP_STRUCT_EXT > () , 20usize , concat ! ("Size of: " , stringify ! (TIMESTAMP_STRUCT_EXT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < TIMESTAMP_STRUCT_EXT > () , 4usize , concat ! ("Alignment of " , stringify ! (TIMESTAMP_STRUCT_EXT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . year as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (year))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . month as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (month))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . day as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (day))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . hour as * const _ as usize } , 6usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . minute as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (minute))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . second as * const _ as usize } , 10usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (second))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . fraction as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (fraction))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT > ())) . fraction2 as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT) , "::" , stringify ! (fraction2))) ;
} pub type SQL_TIMESTAMP_STRUCT_EXT = TIMESTAMP_STRUCT_EXT ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct TIMESTAMP_STRUCT_EXT_TZ { pub year : SQLSMALLINT , pub month : SQLUSMALLINT , pub day : SQLUSMALLINT , pub hour : SQLUSMALLINT , pub minute : SQLUSMALLINT , pub second : SQLUSMALLINT , pub fraction : SQLUINTEGER , pub fraction2 : SQLUINTEGER , pub timezone_hour : SQLSMALLINT , pub timezone_minute : SQLSMALLINT , }
# [test] fn bindgen_test_layout_TIMESTAMP_STRUCT_EXT_TZ () { assert_eq ! (:: std :: mem :: size_of :: < TIMESTAMP_STRUCT_EXT_TZ > () , 24usize , concat ! ("Size of: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ))) ;
    assert_eq ! (:: std :: mem :: align_of :: < TIMESTAMP_STRUCT_EXT_TZ > () , 4usize , concat ! ("Alignment of " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . year as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (year))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . month as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (month))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . day as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (day))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . hour as * const _ as usize } , 6usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . minute as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (minute))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . second as * const _ as usize } , 10usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (second))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . fraction as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (fraction))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . fraction2 as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (fraction2))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . timezone_hour as * const _ as usize } , 20usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (timezone_hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < TIMESTAMP_STRUCT_EXT_TZ > ())) . timezone_minute as * const _ as usize } , 22usize , concat ! ("Offset of field: " , stringify ! (TIMESTAMP_STRUCT_EXT_TZ) , "::" , stringify ! (timezone_minute))) ;
} pub type SQL_TIMESTAMP_STRUCT_EXT_TZ = TIMESTAMP_STRUCT_EXT_TZ ;
pub const SQLINTERVAL_SQL_IS_YEAR : SQLINTERVAL = 1 ;
pub const SQLINTERVAL_SQL_IS_MONTH : SQLINTERVAL = 2 ;
pub const SQLINTERVAL_SQL_IS_DAY : SQLINTERVAL = 3 ;
pub const SQLINTERVAL_SQL_IS_HOUR : SQLINTERVAL = 4 ;
pub const SQLINTERVAL_SQL_IS_MINUTE : SQLINTERVAL = 5 ;
pub const SQLINTERVAL_SQL_IS_SECOND : SQLINTERVAL = 6 ;
pub const SQLINTERVAL_SQL_IS_YEAR_TO_MONTH : SQLINTERVAL = 7 ;
pub const SQLINTERVAL_SQL_IS_DAY_TO_HOUR : SQLINTERVAL = 8 ;
pub const SQLINTERVAL_SQL_IS_DAY_TO_MINUTE : SQLINTERVAL = 9 ;
pub const SQLINTERVAL_SQL_IS_DAY_TO_SECOND : SQLINTERVAL = 10 ;
pub const SQLINTERVAL_SQL_IS_HOUR_TO_MINUTE : SQLINTERVAL = 11 ;
pub const SQLINTERVAL_SQL_IS_HOUR_TO_SECOND : SQLINTERVAL = 12 ;
pub const SQLINTERVAL_SQL_IS_MINUTE_TO_SECOND : SQLINTERVAL = 13 ;
pub type SQLINTERVAL = :: std :: os :: raw :: c_uint ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct tagSQL_YEAR_MONTH { pub year : SQLUINTEGER , pub month : SQLUINTEGER , }
# [test] fn bindgen_test_layout_tagSQL_YEAR_MONTH () { assert_eq ! (:: std :: mem :: size_of :: < tagSQL_YEAR_MONTH > () , 8usize , concat ! ("Size of: " , stringify ! (tagSQL_YEAR_MONTH))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagSQL_YEAR_MONTH > () , 4usize , concat ! ("Alignment of " , stringify ! (tagSQL_YEAR_MONTH))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_YEAR_MONTH > ())) . year as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_YEAR_MONTH) , "::" , stringify ! (year))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_YEAR_MONTH > ())) . month as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (tagSQL_YEAR_MONTH) , "::" , stringify ! (month))) ;
} pub type SQL_YEAR_MONTH_STRUCT = tagSQL_YEAR_MONTH ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct tagSQL_DAY_SECOND { pub day : SQLUINTEGER , pub hour : SQLUINTEGER , pub minute : SQLUINTEGER , pub second : SQLUINTEGER , pub fraction : SQLUINTEGER , }
# [test] fn bindgen_test_layout_tagSQL_DAY_SECOND () { assert_eq ! (:: std :: mem :: size_of :: < tagSQL_DAY_SECOND > () , 20usize , concat ! ("Size of: " , stringify ! (tagSQL_DAY_SECOND))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagSQL_DAY_SECOND > () , 4usize , concat ! ("Alignment of " , stringify ! (tagSQL_DAY_SECOND))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_DAY_SECOND > ())) . day as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_DAY_SECOND) , "::" , stringify ! (day))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_DAY_SECOND > ())) . hour as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (tagSQL_DAY_SECOND) , "::" , stringify ! (hour))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_DAY_SECOND > ())) . minute as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (tagSQL_DAY_SECOND) , "::" , stringify ! (minute))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_DAY_SECOND > ())) . second as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (tagSQL_DAY_SECOND) , "::" , stringify ! (second))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_DAY_SECOND > ())) . fraction as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (tagSQL_DAY_SECOND) , "::" , stringify ! (fraction))) ;
} pub type SQL_DAY_SECOND_STRUCT = tagSQL_DAY_SECOND ;

# [repr (C)]
# [derive (Copy , Clone)] pub struct tagSQL_INTERVAL_STRUCT { pub interval_type : SQLINTERVAL , pub interval_sign : SQLSMALLINT , pub intval : tagSQL_INTERVAL_STRUCT__bindgen_ty_1 , }
# [repr (C)]
# [derive (Copy , Clone)] pub union tagSQL_INTERVAL_STRUCT__bindgen_ty_1 { pub year_month : SQL_YEAR_MONTH_STRUCT , pub day_second : SQL_DAY_SECOND_STRUCT , _bindgen_union_align : [u32 ;
    5usize] , }
# [test] fn bindgen_test_layout_tagSQL_INTERVAL_STRUCT__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < tagSQL_INTERVAL_STRUCT__bindgen_ty_1 > () , 20usize , concat ! ("Size of: " , stringify ! (tagSQL_INTERVAL_STRUCT__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagSQL_INTERVAL_STRUCT__bindgen_ty_1 > () , 4usize , concat ! ("Alignment of " , stringify ! (tagSQL_INTERVAL_STRUCT__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_INTERVAL_STRUCT__bindgen_ty_1 > ())) . year_month as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_INTERVAL_STRUCT__bindgen_ty_1) , "::" , stringify ! (year_month))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_INTERVAL_STRUCT__bindgen_ty_1 > ())) . day_second as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_INTERVAL_STRUCT__bindgen_ty_1) , "::" , stringify ! (day_second))) ;
}
# [test] fn bindgen_test_layout_tagSQL_INTERVAL_STRUCT () { assert_eq ! (:: std :: mem :: size_of :: < tagSQL_INTERVAL_STRUCT > () , 28usize , concat ! ("Size of: " , stringify ! (tagSQL_INTERVAL_STRUCT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagSQL_INTERVAL_STRUCT > () , 4usize , concat ! ("Alignment of " , stringify ! (tagSQL_INTERVAL_STRUCT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_INTERVAL_STRUCT > ())) . interval_type as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_INTERVAL_STRUCT) , "::" , stringify ! (interval_type))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_INTERVAL_STRUCT > ())) . interval_sign as * const _ as usize } , 4usize , concat ! ("Offset of field: " , stringify ! (tagSQL_INTERVAL_STRUCT) , "::" , stringify ! (interval_sign))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_INTERVAL_STRUCT > ())) . intval as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (tagSQL_INTERVAL_STRUCT) , "::" , stringify ! (intval))) ;
} pub type SQL_INTERVAL_STRUCT = tagSQL_INTERVAL_STRUCT ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct tagSQL_NUMERIC_STRUCT { pub precision : SQLCHAR , pub scale : SQLSCHAR , pub sign : SQLCHAR , pub val : [SQLCHAR ;
    16usize] , }
# [test] fn bindgen_test_layout_tagSQL_NUMERIC_STRUCT () { assert_eq ! (:: std :: mem :: size_of :: < tagSQL_NUMERIC_STRUCT > () , 19usize , concat ! ("Size of: " , stringify ! (tagSQL_NUMERIC_STRUCT))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagSQL_NUMERIC_STRUCT > () , 1usize , concat ! ("Alignment of " , stringify ! (tagSQL_NUMERIC_STRUCT))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_NUMERIC_STRUCT > ())) . precision as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagSQL_NUMERIC_STRUCT) , "::" , stringify ! (precision))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_NUMERIC_STRUCT > ())) . scale as * const _ as usize } , 1usize , concat ! ("Offset of field: " , stringify ! (tagSQL_NUMERIC_STRUCT) , "::" , stringify ! (scale))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_NUMERIC_STRUCT > ())) . sign as * const _ as usize } , 2usize , concat ! ("Offset of field: " , stringify ! (tagSQL_NUMERIC_STRUCT) , "::" , stringify ! (sign))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagSQL_NUMERIC_STRUCT > ())) . val as * const _ as usize } , 3usize , concat ! ("Offset of field: " , stringify ! (tagSQL_NUMERIC_STRUCT) , "::" , stringify ! (val))) ;
} pub type SQL_NUMERIC_STRUCT = tagSQL_NUMERIC_STRUCT ;

# [repr (C)]
# [derive (Copy , Clone)] pub struct SQLDECIMAL64 { pub udec64 : SQLDECIMAL64__bindgen_ty_1 , }
# [repr (C)]
# [derive (Copy , Clone)] pub union SQLDECIMAL64__bindgen_ty_1 { pub dummy : SQLDOUBLE , pub dec64 : [SQLCHAR ;
    8usize] , _bindgen_union_align : u64 , }
# [test] fn bindgen_test_layout_SQLDECIMAL64__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < SQLDECIMAL64__bindgen_ty_1 > () , 8usize , concat ! ("Size of: " , stringify ! (SQLDECIMAL64__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < SQLDECIMAL64__bindgen_ty_1 > () , 8usize , concat ! ("Alignment of " , stringify ! (SQLDECIMAL64__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL64__bindgen_ty_1 > ())) . dummy as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL64__bindgen_ty_1) , "::" , stringify ! (dummy))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL64__bindgen_ty_1 > ())) . dec64 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL64__bindgen_ty_1) , "::" , stringify ! (dec64))) ;
}
# [test] fn bindgen_test_layout_SQLDECIMAL64 () { assert_eq ! (:: std :: mem :: size_of :: < SQLDECIMAL64 > () , 8usize , concat ! ("Size of: " , stringify ! (SQLDECIMAL64))) ;
    assert_eq ! (:: std :: mem :: align_of :: < SQLDECIMAL64 > () , 8usize , concat ! ("Alignment of " , stringify ! (SQLDECIMAL64))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL64 > ())) . udec64 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL64) , "::" , stringify ! (udec64))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub struct SQLDECIMAL128 { pub udec128 : SQLDECIMAL128__bindgen_ty_1 , }
# [repr (C)]
# [derive (Copy , Clone)] pub union SQLDECIMAL128__bindgen_ty_1 { pub dummy : SQLDOUBLE , pub dec128 : [SQLCHAR ;
    16usize] , _bindgen_union_align : [u64 ;
    2usize] , }
# [test] fn bindgen_test_layout_SQLDECIMAL128__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < SQLDECIMAL128__bindgen_ty_1 > () , 16usize , concat ! ("Size of: " , stringify ! (SQLDECIMAL128__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < SQLDECIMAL128__bindgen_ty_1 > () , 8usize , concat ! ("Alignment of " , stringify ! (SQLDECIMAL128__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL128__bindgen_ty_1 > ())) . dummy as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL128__bindgen_ty_1) , "::" , stringify ! (dummy))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL128__bindgen_ty_1 > ())) . dec128 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL128__bindgen_ty_1) , "::" , stringify ! (dec128))) ;
}
# [test] fn bindgen_test_layout_SQLDECIMAL128 () { assert_eq ! (:: std :: mem :: size_of :: < SQLDECIMAL128 > () , 16usize , concat ! ("Size of: " , stringify ! (SQLDECIMAL128))) ;
    assert_eq ! (:: std :: mem :: align_of :: < SQLDECIMAL128 > () , 8usize , concat ! ("Alignment of " , stringify ! (SQLDECIMAL128))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQLDECIMAL128 > ())) . udec128 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQLDECIMAL128) , "::" , stringify ! (udec128))) ;
} extern "C" { pub fn SQLAllocConnect (henv : SQLHENV , phdbc : * mut SQLHDBC) -> SQLRETURN ;
} extern "C" { pub fn SQLAllocEnv (phenv : * mut SQLHENV) -> SQLRETURN ;
} extern "C" { pub fn SQLAllocStmt (hdbc : SQLHDBC , phstmt : * mut SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLAllocHandle (fHandleType : SQLSMALLINT , hInput : SQLHANDLE , phOutput : * mut SQLHANDLE) -> SQLRETURN ;
} extern "C" { pub fn SQLBindCol (hstmt : SQLHSTMT , icol : SQLUSMALLINT , fCType : SQLSMALLINT , rgbValue : SQLPOINTER , cbValueMax : SQLINTEGER , pcbValue : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLCancel (hstmt : SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLColAttribute (hstmt : SQLHSTMT , icol : SQLUSMALLINT , fDescType : SQLUSMALLINT , rgbDesc : SQLPOINTER , cbDescMax : SQLSMALLINT , pcbDesc : * mut SQLSMALLINT , pfDesc : SQLPOINTER) -> SQLRETURN ;
} extern "C" { pub fn SQLConnect (hdbc : SQLHDBC , szDSN : * mut SQLCHAR , cbDSN : SQLSMALLINT , szUID : * mut SQLCHAR , cbUID : SQLSMALLINT , szAuthStr : * mut SQLCHAR , cbAuthStr : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLDescribeCol (hstmt : SQLHSTMT , icol : SQLUSMALLINT , szColName : * mut SQLCHAR , cbColNameMax : SQLSMALLINT , pcbColName : * mut SQLSMALLINT , pfSqlType : * mut SQLSMALLINT , pcbColDef : * mut SQLUINTEGER , pibScale : * mut SQLSMALLINT , pfNullable : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLDisconnect (hdbc : SQLHDBC) -> SQLRETURN ;
} extern "C" { pub fn SQLError (henv : SQLHENV , hdbc : SQLHDBC , hstmt : SQLHSTMT , szSqlState : * mut SQLCHAR , pfNativeError : * mut SQLINTEGER , szErrorMsg : * mut SQLCHAR , cbErrorMsgMax : SQLSMALLINT , pcbErrorMsg : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLExecDirect (hstmt : SQLHSTMT , szSqlStr : * mut SQLCHAR , cbSqlStr : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLExecute (hstmt : SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLFetch (hstmt : SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLFreeConnect (hdbc : SQLHDBC) -> SQLRETURN ;
} extern "C" { pub fn SQLFreeEnv (henv : SQLHENV) -> SQLRETURN ;
} extern "C" { pub fn SQLFreeStmt (hstmt : SQLHSTMT , fOption : SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLCloseCursor (hStmt : SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLGetCursorName (hstmt : SQLHSTMT , szCursor : * mut SQLCHAR , cbCursorMax : SQLSMALLINT , pcbCursor : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLGetData (hstmt : SQLHSTMT , icol : SQLUSMALLINT , fCType : SQLSMALLINT , rgbValue : SQLPOINTER , cbValueMax : SQLINTEGER , pcbValue : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLNumResultCols (hstmt : SQLHSTMT , pccol : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLPrepare (hstmt : SQLHSTMT , szSqlStr : * mut SQLCHAR , cbSqlStr : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLRowCount (hstmt : SQLHSTMT , pcrow : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLSetCursorName (hstmt : SQLHSTMT , szCursor : * mut SQLCHAR , cbCursor : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLSetParam (hstmt : SQLHSTMT , ipar : SQLUSMALLINT , fCType : SQLSMALLINT , fSqlType : SQLSMALLINT , cbParamDef : SQLUINTEGER , ibScale : SQLSMALLINT , rgbValue : SQLPOINTER , pcbValue : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLTransact (henv : SQLHENV , hdbc : SQLHDBC , fType : SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLEndTran (fHandleType : SQLSMALLINT , hHandle : SQLHANDLE , fType : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLFreeHandle (fHandleType : SQLSMALLINT , hHandle : SQLHANDLE) -> SQLRETURN ;
} extern "C" { pub fn SQLGetDiagRec (fHandleType : SQLSMALLINT , hHandle : SQLHANDLE , iRecNumber : SQLSMALLINT , pszSqlState : * mut SQLCHAR , pfNativeError : * mut SQLINTEGER , pszErrorMsg : * mut SQLCHAR , cbErrorMsgMax : SQLSMALLINT , pcbErrorMsg : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLGetDiagField (fHandleType : SQLSMALLINT , hHandle : SQLHANDLE , iRecNumber : SQLSMALLINT , fDiagIdentifier : SQLSMALLINT , pDiagInfo : SQLPOINTER , cbDiagInfoMax : SQLSMALLINT , pcbDiagInfo : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLCopyDesc (hDescSource : SQLHDESC , hDescTarget : SQLHDESC) -> SQLRETURN ;
} extern "C" { pub fn SQLCreateDb (hDbc : SQLHDBC , szDB : * mut SQLCHAR , cbDB : SQLINTEGER , szCodeset : * mut SQLCHAR , cbCodeset : SQLINTEGER , szMode : * mut SQLCHAR , cbMode : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLDropDb (hDbc : SQLHDBC , szDB : * mut SQLCHAR , cbDB : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLCreatePkg (hDbc : SQLHDBC , szBindFileName : * mut SQLCHAR , cbBindFileName : SQLINTEGER , szBindOpts : * mut SQLCHAR , cbBindOpts : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLGetDescField (DescriptorHandle : SQLHDESC , RecNumber : SQLSMALLINT , FieldIdentifier : SQLSMALLINT , Value : SQLPOINTER , BufferLength : SQLINTEGER , StringLength : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLGetDescRec (DescriptorHandle : SQLHDESC , RecNumber : SQLSMALLINT , Name : * mut SQLCHAR , BufferLength : SQLSMALLINT , StringLength : * mut SQLSMALLINT , Type : * mut SQLSMALLINT , SubType : * mut SQLSMALLINT , Length : * mut SQLINTEGER , Precision : * mut SQLSMALLINT , Scale : * mut SQLSMALLINT , Nullable : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLSetDescField (DescriptorHandle : SQLHDESC , RecNumber : SQLSMALLINT , FieldIdentifier : SQLSMALLINT , Value : SQLPOINTER , BufferLength : SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLSetDescRec (DescriptorHandle : SQLHDESC , RecNumber : SQLSMALLINT , Type : SQLSMALLINT , SubType : SQLSMALLINT , Length : SQLINTEGER , Precision : SQLSMALLINT , Scale : SQLSMALLINT , Data : SQLPOINTER , StringLength : * mut SQLINTEGER , Indicator : * mut SQLINTEGER) -> SQLRETURN ;
} pub type LPWSTR = * mut SQLWCHAR ;
pub type DWORD = sqluint32 ;
pub type BOOL = :: std :: os :: raw :: c_uint ;
pub type WCHAR = wchar_t ;

# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct _TAGGUID { pub Data1 : :: std :: os :: raw :: c_ulong , pub Data2 : :: std :: os :: raw :: c_ushort , pub Data3 : :: std :: os :: raw :: c_ushort , pub Data4 : [:: std :: os :: raw :: c_uchar ;
    8usize] , }
# [test] fn bindgen_test_layout__TAGGUID () { assert_eq ! (:: std :: mem :: size_of :: < _TAGGUID > () , 24usize , concat ! ("Size of: " , stringify ! (_TAGGUID))) ;
    assert_eq ! (:: std :: mem :: align_of :: < _TAGGUID > () , 8usize , concat ! ("Alignment of " , stringify ! (_TAGGUID))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < _TAGGUID > ())) . Data1 as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (_TAGGUID) , "::" , stringify ! (Data1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < _TAGGUID > ())) . Data2 as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (_TAGGUID) , "::" , stringify ! (Data2))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < _TAGGUID > ())) . Data3 as * const _ as usize } , 10usize , concat ! ("Offset of field: " , stringify ! (_TAGGUID) , "::" , stringify ! (Data3))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < _TAGGUID > ())) . Data4 as * const _ as usize } , 12usize , concat ! ("Offset of field: " , stringify ! (_TAGGUID) , "::" , stringify ! (Data4))) ;
} pub type TAGGUID = _TAGGUID ;
pub type SQLSTATE = [SQLTCHAR ;
    6usize] ;
extern "C" { pub fn SQLDriverConnect (hdbc : SQLHDBC , hwnd : SQLHWND , szConnStrIn : * mut SQLCHAR , cchConnStrIn : SQLSMALLINT , szConnStrOut : * mut SQLCHAR , cchConnStrOutMax : SQLSMALLINT , pcchConnStrOut : * mut SQLSMALLINT , fDriverCompletion : SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLBrowseConnect (hdbc : SQLHDBC , szConnStrIn : * mut SQLCHAR , cchConnStrIn : SQLSMALLINT , szConnStrOut : * mut SQLCHAR , cchConnStrOutMax : SQLSMALLINT , pcchConnStrOut : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLBulkOperations (StatementHandle : SQLHSTMT , Operation : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLColAttributes (hstmt : SQLHSTMT , icol : SQLUSMALLINT , fDescType : SQLUSMALLINT , rgbDesc : SQLPOINTER , cbDescMax : SQLSMALLINT , pcbDesc : * mut SQLSMALLINT , pfDesc : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLColumnPrivileges (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cchCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cchSchemaName : SQLSMALLINT , szTableName : * mut SQLCHAR , cchTableName : SQLSMALLINT , szColumnName : * mut SQLCHAR , cchColumnName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLDescribeParam (hstmt : SQLHSTMT , ipar : SQLUSMALLINT , pfSqlType : * mut SQLSMALLINT , pcbParamDef : * mut SQLUINTEGER , pibScale : * mut SQLSMALLINT , pfNullable : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLExtendedFetch (hstmt : SQLHSTMT , fFetchType : SQLUSMALLINT , irow : SQLINTEGER , pcrow : * mut SQLUINTEGER , rgfRowStatus : * mut SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLForeignKeys (hstmt : SQLHSTMT , szPkCatalogName : * mut SQLCHAR , cchPkCatalogName : SQLSMALLINT , szPkSchemaName : * mut SQLCHAR , cchPkSchemaName : SQLSMALLINT , szPkTableName : * mut SQLCHAR , cchPkTableName : SQLSMALLINT , szFkCatalogName : * mut SQLCHAR , cchFkCatalogName : SQLSMALLINT , szFkSchemaName : * mut SQLCHAR , cchFkSchemaName : SQLSMALLINT , szFkTableName : * mut SQLCHAR , cchFkTableName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLMoreResults (hstmt : SQLHSTMT) -> SQLRETURN ;
} extern "C" { pub fn SQLNativeSql (hdbc : SQLHDBC , szSqlStrIn : * mut SQLCHAR , cchSqlStrIn : SQLINTEGER , szSqlStr : * mut SQLCHAR , cchSqlStrMax : SQLINTEGER , pcbSqlStr : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLNumParams (hstmt : SQLHSTMT , pcpar : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLParamOptions (hstmt : SQLHSTMT , crow : SQLUINTEGER , pirow : * mut SQLUINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLPrimaryKeys (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cchCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cchSchemaName : SQLSMALLINT , szTableName : * mut SQLCHAR , cchTableName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLProcedureColumns (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cchCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cchSchemaName : SQLSMALLINT , szProcName : * mut SQLCHAR , cchProcName : SQLSMALLINT , szColumnName : * mut SQLCHAR , cchColumnName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLProcedures (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cchCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cchSchemaName : SQLSMALLINT , szProcName : * mut SQLCHAR , cchProcName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLSetPos (hstmt : SQLHSTMT , irow : SQLUSMALLINT , fOption : SQLUSMALLINT , fLock : SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLTablePrivileges (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cchCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cchSchemaName : SQLSMALLINT , szTableName : * mut SQLCHAR , cchTableName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLDrivers (henv : SQLHENV , fDirection : SQLUSMALLINT , szDriverDesc : * mut SQLCHAR , cchDriverDescMax : SQLSMALLINT , pcchDriverDesc : * mut SQLSMALLINT , szDriverAttributes : * mut SQLCHAR , cchDrvrAttrMax : SQLSMALLINT , pcchDrvrAttr : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLBindParameter (hstmt : SQLHSTMT , ipar : SQLUSMALLINT , fParamType : SQLSMALLINT , fCType : SQLSMALLINT , fSqlType : SQLSMALLINT , cbColDef : SQLUINTEGER , ibScale : SQLSMALLINT , rgbValue : SQLPOINTER , cbValueMax : SQLINTEGER , pcbValue : * mut SQLINTEGER) -> SQLRETURN ;
} extern "C" { pub fn SQLAllocHandleStd (fHandleType : SQLSMALLINT , hInput : SQLHANDLE , phOutput : * mut SQLHANDLE) -> SQLRETURN ;
} extern "C" { pub fn SQLSetScrollOptions (hstmt : SQLHSTMT , fConcurrency : SQLUSMALLINT , crowKeyset : SQLINTEGER , crowRowset : SQLUSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn TraceOpenLogFile (szFileName : LPWSTR , lpwszOutputMsg : LPWSTR , cbOutputMsg : DWORD) -> RETCODE ;
} extern "C" { pub fn TraceCloseLogFile () -> RETCODE ;
} extern "C" { pub fn TraceReturn (arg1 : RETCODE , arg2 : RETCODE) ;
} extern "C" { pub fn TraceVersion () -> DWORD ;
} extern "C" { pub fn TraceVSControl (arg1 : DWORD) -> RETCODE ;
} extern "C" { pub fn ODBCSetTryWaitValue (dwValue : DWORD) -> BOOL ;
} extern "C" { pub fn ODBCGetTryWaitValue () -> DWORD ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub struct tagODBC_VS_ARGS { pub pguidEvent : * const TAGGUID , pub dwFlags : DWORD , pub __bindgen_anon_1 : tagODBC_VS_ARGS__bindgen_ty_1 , pub __bindgen_anon_2 : tagODBC_VS_ARGS__bindgen_ty_2 , pub RetCode : RETCODE , }
# [repr (C)]
# [derive (Copy , Clone)] pub union tagODBC_VS_ARGS__bindgen_ty_1 { pub wszArg : * mut WCHAR , pub szArg : * mut :: std :: os :: raw :: c_char , _bindgen_union_align : u64 , }
# [test] fn bindgen_test_layout_tagODBC_VS_ARGS__bindgen_ty_1 () { assert_eq ! (:: std :: mem :: size_of :: < tagODBC_VS_ARGS__bindgen_ty_1 > () , 8usize , concat ! ("Size of: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_1))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagODBC_VS_ARGS__bindgen_ty_1 > () , 8usize , concat ! ("Alignment of " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_1))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS__bindgen_ty_1 > ())) . wszArg as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_1) , "::" , stringify ! (wszArg))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS__bindgen_ty_1 > ())) . szArg as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_1) , "::" , stringify ! (szArg))) ;
}
# [repr (C)]
# [derive (Copy , Clone)] pub union tagODBC_VS_ARGS__bindgen_ty_2 { pub wszCorrelation : * mut WCHAR , pub szCorrelation : * mut :: std :: os :: raw :: c_char , _bindgen_union_align : u64 , }
# [test] fn bindgen_test_layout_tagODBC_VS_ARGS__bindgen_ty_2 () { assert_eq ! (:: std :: mem :: size_of :: < tagODBC_VS_ARGS__bindgen_ty_2 > () , 8usize , concat ! ("Size of: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_2))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagODBC_VS_ARGS__bindgen_ty_2 > () , 8usize , concat ! ("Alignment of " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_2))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS__bindgen_ty_2 > ())) . wszCorrelation as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_2) , "::" , stringify ! (wszCorrelation))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS__bindgen_ty_2 > ())) . szCorrelation as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS__bindgen_ty_2) , "::" , stringify ! (szCorrelation))) ;
}
# [test] fn bindgen_test_layout_tagODBC_VS_ARGS () { assert_eq ! (:: std :: mem :: size_of :: < tagODBC_VS_ARGS > () , 40usize , concat ! ("Size of: " , stringify ! (tagODBC_VS_ARGS))) ;
    assert_eq ! (:: std :: mem :: align_of :: < tagODBC_VS_ARGS > () , 8usize , concat ! ("Alignment of " , stringify ! (tagODBC_VS_ARGS))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS > ())) . pguidEvent as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS) , "::" , stringify ! (pguidEvent))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS > ())) . dwFlags as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS) , "::" , stringify ! (dwFlags))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < tagODBC_VS_ARGS > ())) . RetCode as * const _ as usize } , 32usize , concat ! ("Offset of field: " , stringify ! (tagODBC_VS_ARGS) , "::" , stringify ! (RetCode))) ;
} pub type ODBC_VS_ARGS = tagODBC_VS_ARGS ;
pub type PODBC_VS_ARGS = * mut tagODBC_VS_ARGS ;
extern "C" { pub fn FireVSDebugEvent (arg1 : PODBC_VS_ARGS) ;
}
# [repr (C)]
# [derive (Debug , Copy , Clone)] pub struct SQL_NET_STATS { pub iNetStatsLength : SQLINTEGER , pub uiNetStatsServerTime : SQLUBIGINT , pub uiNetStatsNetworkTime : SQLUBIGINT , pub uiNetStatsBytesSent : SQLUBIGINT , pub uiNetStatsBytesReceived : SQLUBIGINT , pub uiNetStatsRoundTrips : SQLUBIGINT , }
# [test] fn bindgen_test_layout_SQL_NET_STATS () { assert_eq ! (:: std :: mem :: size_of :: < SQL_NET_STATS > () , 48usize , concat ! ("Size of: " , stringify ! (SQL_NET_STATS))) ;
    assert_eq ! (:: std :: mem :: align_of :: < SQL_NET_STATS > () , 8usize , concat ! ("Alignment of " , stringify ! (SQL_NET_STATS))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . iNetStatsLength as * const _ as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (iNetStatsLength))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . uiNetStatsServerTime as * const _ as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (uiNetStatsServerTime))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . uiNetStatsNetworkTime as * const _ as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (uiNetStatsNetworkTime))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . uiNetStatsBytesSent as * const _ as usize } , 24usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (uiNetStatsBytesSent))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . uiNetStatsBytesReceived as * const _ as usize } , 32usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (uiNetStatsBytesReceived))) ;
    assert_eq ! (unsafe { & (* (:: std :: ptr :: null :: < SQL_NET_STATS > ())) . uiNetStatsRoundTrips as * const _ as usize } , 40usize , concat ! ("Offset of field: " , stringify ! (SQL_NET_STATS) , "::" , stringify ! (uiNetStatsRoundTrips))) ;
} extern "C" { pub fn SQLColumns (hstmt : SQLHSTMT , szCatalogName : * mut SQLCHAR , cbCatalogName : SQLSMALLINT , szSchemaName : * mut SQLCHAR , cbSchemaName : SQLSMALLINT , szTableName : * mut SQLCHAR , cbTableName : SQLSMALLINT , szColumnName : * mut SQLCHAR , cbColumnName : SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLDataSources (henv : SQLHENV , fDirection : SQLUSMALLINT , szDSN : * mut SQLCHAR , cbDSNMax : SQLSMALLINT , pcbDSN : * mut SQLSMALLINT , szDescription : * mut SQLCHAR , cbDescriptionMax : SQLSMALLINT , pcbDescription : * mut SQLSMALLINT) -> SQLRETURN ;
} extern "C" { pub fn SQLFetchScroll (StatementHandle : SQLHSTMT , FetchOrientation : SQLSMALLINT , FetchOffset : SQLINTEGER) -> SQLRETURN ;
